// #include <stdio.h>


// int main()
// {
//     int num1 = 11;
//     float num2 = 4.4f;

//     printf("%f\n", num1 + num2); // 15.400000 : 정수와 실수 덧셈 정수는 실수로 변환.
//     printf("%f\n", num1 - num2); // 15.400000 : 정수와 실수 뺄셈 정수는 실수로 변환.
//     printf("%f\n", num1 * num2); // 15.400000 : 정수와 실수 곱셈 정수는 실수로 변환.
//     printf("%f\n", num1 / num2); // 15.400000 : 정수와 실수 나눗셈 정수는 실수로 변환.

//     return 0;
// }

// c언어에서 자료형을 섞어서 쓰면 컴파일러에서 암시적 형 변환을 하게된다.
// 자료형의 크기가 큰 쪽, 표현 범위가 넓은 쪽으로 자동 변환된다.
// 이를 형 확장이라 하는데 값이 버려지지 않고 그대로 보전된다.

